src/Catalogs/СтатьиДДС/СтатьиДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДДС</name>
  <predefined>
    <items>
      <name>Аренда</name>
      <description>Аренда</description>
    </items>
    <items>
      <name>ЗаТовары</name>
      <description>За товары</description>
    </items>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>ЗарплатаНаКК</name>
      <description>Зарплата на к/к</description>
    </items>
    <items>
      <name>Инкассация</name>
      <description>Инкассация</description>
    </items>
    <items>
      <name>КомиссияБанка</name>
      <description>Комиссия банка</description>
    </items>
    <items>
      <name>Налог</name>
      <description>Налог</description>
    </items>
    <items>
      <name>Приход</name>
      <description>Приход</description>
    </items>
    <items>
      <name>ПриходПоКК</name>
      <description>Приход по к/к</description>
    </items>
    <items>
      <name>Расход</name>
      <description>Расход</description>
    </items>
  </predefined>
  <attributes>
    <name>КатегорияДвиженияДенежныхСредств</name>
    <type>
      <types>EnumRef.КатегорииДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОперацииПоУмолчанию</name>
    <type>
      <types>CatalogRef.КатегорииОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьСчетаКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьДоговораКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьСуммыКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчитыватьСуммуНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьНазначениеПлатежа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьКатегориюОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПоУмолчанию</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/СтатистическийАнализ/СтатистическийАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистическийАнализ</name>
  <resources>
    <name>ЧастотаИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектАнализа</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КатегорииДвиженияДенежныхСредств/КатегорииДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтатьиДДС/ManagerModule.bsl
Функция СтатьиДДСПриход() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатьиДДС.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СтатистическийАнализ.ЧастотаИспользования, 0) КАК ЧастотаИспользования
	|ИЗ
	|	Справочник.СтатьиДДС КАК СтатьиДДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистическийАнализ КАК СтатистическийАнализ
	|		ПО СтатистическийАнализ.ОбъектАнализа = СтатьиДДС.Ссылка
	|ГДЕ
	|	СтатьиДДС.КатегорияДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.КатегорииДвиженияДенежныхСредств.Поступление))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧастотаИспользования УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивРезультат = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивРезультат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

Функция СтатьиДДСРасход() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатьиДДС.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СтатистическийАнализ.ЧастотаИспользования, 0) КАК ЧастотаИспользования
	|ИЗ
	|	Справочник.СтатьиДДС КАК СтатьиДДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистическийАнализ КАК СтатистическийАнализ
	|		ПО СтатистическийАнализ.ОбъектАнализа = СтатьиДДС.Ссылка
	|ГДЕ
	|	СтатьиДДС.КатегорияДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.КатегорииДвиженияДенежныхСредств.Списание))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧастотаИспользования УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивРезультат = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивРезультат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции
